app/controllers/api/comments_controller.rb

  def update
    @comment = Comment.find(params[:id])
    if (@comment && @comment.update(comment_params))
      # render json: @comment
      @comments = Comment.all
---
SELECT "comments".* FROM "comments"