app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("body", "commenter_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "try it!"], ["commenter_id", 2], ["recipe_id", 3], ["created_at", "2021-12-01 23:18:49.258904"], ["updated_at", "2021-12-01 23:18:49.258904"]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "asdf"], ["updated_at", "2021-11-29 21:55:45.111858"], ["id", 34]]
---
  def update
    @comment = Comment.find(params[:id])
    if (@comment && @comment.update(comment_params))

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 36]]
SELECT "comments".* FROM "comments"
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.delete if @comment
    @comments = Comment.all