app/controllers/api/follows_controller.rb

  def create
    @follow = Follow.new(follow_params)
    if @follow.save
---
INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 1], ["followed_user_id", 3], ["created_at", "2021-12-01 01:15:08.235851"], ["updated_at", "2021-12-01 01:15:08.235851"]]

  def destroy
    @follow = Follow.find(params[:id])
    @follow.delete if @follow
    @follows = Follow.all
---
SELECT  "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 2]]
SELECT "follows".* FROM "follows"