app/controllers/api/recipes_controller.rb

INSERT INTO "recipes" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "writing a recipe"], ["body", "here's where the stuff goes"], ["author_id", 1], ["created_at", "2021-12-01 18:05:56.981124"], ["updated_at", "2021-12-01 18:05:56.981124"]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save