app/controllers/api/stories_controller.rb

INSERT INTO "stories" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["body", "test"], ["author_id", 1], ["created_at", "2021-11-24 01:22:11.499173"], ["updated_at", "2021-11-24 01:22:11.499173"]]
---
  def create
    @story = Story.new(story_params)
    if @story.save

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "stories" SET "body" = $1, "updated_at" = $2 WHERE "stories"."id" = $3  [["body", "should be able to update a story"], ["updated_at", "2021-11-28 23:52:04.307897"], ["id", 36]]
---
  def update
    @story = Story.find(params[:id])
    if (@story && @story.update(story_params))

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 39]]
---
  def destroy
    @story = Story.find(params[:id])
    @story.delete if @story