app/controllers/api/yums_controller.rb

INSERT INTO "yums" ("yummer_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["yummer_id", 1], ["recipe_id", 1], ["created_at", "2021-12-01 18:03:25.636006"], ["updated_at", "2021-12-01 18:03:25.636006"]]
---
  def create
    @yum = Yum.new(yum_params)
    if @yum.save