app/models/user.rb

  def generate_session_token
    new_token = SecureRandom.urlsafe_base64
    while User.find_by(session_token: new_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "nVrnaBj5NwKYc2f1IeW5zQ"], ["LIMIT", 1]]